""" Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами, 
що випали випадковим чином і в певному діапазоні під час чергового тиражу. 
Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати набір 
унікальних випадкових чисел для таких лотерей. Вона буде повертати випадковий набір чисел у межах заданих 
параметрів, причому всі випадкові числа в наборі повинні бути унікальні.
Вимоги до завдання:
Параметри функції:
min - мінімальне можливе число у наборі (не менше 1).
max - максимальне можливе число у наборі (не більше 1000).
quantity - кількість чисел, які потрібно вибрати (значення між min і max).
Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
Функція повертає список випадково вибраних, відсортованих чисел. Числа в наборі не повинні повторюватися. 
Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список."""


import random

def get_numbers_ticket(min_num, max_num, quantity):
    if min_num < 1 or max_num > 1000:
        return [] 
    if min_num >= max_num:
        return [] 
    if quantity < 1 or quantity > (max_num - min_num + 1):
        return [] 

    numbers = random.sample(range(min_num, max_num + 1), quantity)
    numbers.sort()
    return numbers


print("Ваші лотерейні числа:", get_numbers_ticket(1, 49, 6))
print(get_numbers_ticket(10, 10, 10))  
print(get_numbers_ticket(10, 15, 9))

